Revit 2026 API
IRevisionsOnSheetUIServer Interface
 The interface used to provide UI for sheet's Revisions On Sheet property.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public interface IRevisionsOnSheetUIServer : IExternalServer
Public Interface IRevisionsOnSheetUIServer
	Inherits IExternalServer
public interface class IRevisionsOnSheetUIServer : IExternalServer
type IRevisionsOnSheetUIServer =
    interface
        interface IExternalServer
    end
The IRevisionsOnSheetUIServer type exposes the following members.
Methods
Name | Description
GetDescription |  Implement this method to return a description of the server.
(Inherited from IExternalServer)
GetName |  Implement this method to return the name of the server.
(Inherited from IExternalServer)
GetServerId |  Implement this method to return the id of the server.
(Inherited from IExternalServer)
GetServiceId |  Implement this method to return the id of the service.
(Inherited from IExternalServer)
GetVendorId |  Implement this method to return the id of the vendor of the server.
(Inherited from IExternalServer)
ShowDialog |  Shows dialog on managing RevisionsOnSheetUI.
Top
See Also
Reference
Autodesk.Revit.UI Namespace